Revit 2027 API
IFCProductWrapper.Create(IFCProductWrapper, Boolean) Method
 Establishes a new product manager for elements and objects derived from a parent product manager, allowing override of allowRelateToLevel
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCProductWrapper Create(
	IFCProductWrapper pProductWrapper,
	bool allowRelateToLevel
)
Public Shared Function Create (
	pProductWrapper As IFCProductWrapper,
	allowRelateToLevel As Boolean
) As IFCProductWrapper
public:
static IFCProductWrapper^ Create(
	IFCProductWrapper^ pProductWrapper,
	bool allowRelateToLevel
)
static member Create :
        pProductWrapper : IFCProductWrapper *
        allowRelateToLevel : bool -> IFCProductWrapper
Parameters
pProductWrapper IFCProductWrapper
 The parent product manager.
allowRelateToLevel Boolean
 True to allow associated elements and objects to relate to a level, false to never allow such a relationship.
Return Value
IFCProductWrapper
 The new product manager.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCProductWrapper Class
Create Overload
Autodesk.Revit.DB.IFC Namespace